In [1]:
import pandas as pd

In [2]:
#Código para "fingir" que os dados estão rodando através de um navegador (Google Colaboratory)
import requests

url_1 = 'https://cdn3.gnarususercontent.com.br/2928-transformacao-manipulacao-dados/dados_locacao_imoveis.json'
url_2 = 'https://cdn3.gnarususercontent.com.br/2928-transformacao-manipulacao-dados/dados_vendas_clientes.json'


header = {
  "User-Agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/50.0.2661.75 Safari/537.36",
  "X-Requested-With": "XMLHttpRequest"
}

r = requests.get(url_1, headers=header)
s = requests.get(url_2, headers=header)

dados_locacao = pd.read_json(r.text)
dados_vendas = pd.read_json(s.text)

C:\Users\diego\AppData\Local\Temp\ipykernel_10208\4063391176.py:16: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  dados_locacao = pd.read_json(r.text)
C:\Users\diego\AppData\Local\Temp\ipykernel_10208\4063391176.py:17: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  dados_vendas = pd.read_json(s.text)

# Aula 1

In [3]:
dados_locacao = pd.json_normalize(dados_locacao['dados_locacao'])
dados_locacao.head(1)

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel
0,A101 (blocoAP),"[01/06/2022, 01/07/2022]","[05/06/2022, 03/07/2022]","[$ 1000,0 reais, $ 2500,0 reais]"

In [4]:
dados_vendas = pd.json_normalize(dados_vendas['dados_vendas'])
dados_vendas.head(1)

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","[R$ 836,5, R$ 573,33, R$ 392,8, R$ 512,34]"

# Aula 2

##### Para o DataFrame 'dados_vendas':

In [5]:
#Removendo dados de listas:
colunas = list(dados_vendas.columns)
dados_vendas = dados_vendas.explode(colunas[1:])
dados_vendas.head(1)

  Data de venda          Cliente Valor da compra
0    06/06/2022  @ANA _LUCIA 321        R$ 836,5

In [6]:
#Verificando os tipos contidos:
dados_vendas.info()
#Existe apenas uma coluna numérica, que é 'Valor da compra'

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 0 to 4
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     object
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     object
dtypes: object(3)
memory usage: 640.0+ bytes

In [7]:
#Transformando a coluna 'Valor da compra' em tipo numérico (tratado e convertido):
dados_vendas['Valor da compra'] = dados_vendas['Valor da compra']\
.apply(lambda x: x.replace('R$', '').replace(',', '.').strip())

In [8]:
#Será necessário importar a biblioteca Numpy:
import numpy as np

In [9]:
dados_vendas['Valor da compra'] = dados_vendas['Valor da compra'].astype(np.float64)

In [10]:
dados_vendas['Valor da compra']

0    836.50
0    573.33
0    392.80
0    512.34
1    825.31
1    168.07
1    339.18
1    314.69
2    682.05
2    386.34
2    622.65
2    630.79
3    390.30
3    759.16
3    334.47
3    678.78
4    314.24
4    311.15
4    899.16
4    885.24
Name: Valor da compra, dtype: float64

##### Para o DataFrame 'dados_locacao':

In [11]:
dados_locacao.head(1)

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel
0,A101 (blocoAP),"[01/06/2022, 01/07/2022]","[05/06/2022, 03/07/2022]","[$ 1000,0 reais, $ 2500,0 reais]"

In [12]:
#Eliminando as listas ocntindas nas colunas:
lista_locacao = list(dados_locacao.columns)
dados_locacao = dados_locacao.explode(lista_locacao[1:])
dados_locacao.head(1)

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel
0,A101 (blocoAP),01/06/2022,05/06/2022,"$ 1000,0 reais"

In [13]:
#Verificando os tipos de dados:
dados_locacao.info()
#'valor_aluguel' é a única coluna numérica

<class 'pandas.core.frame.DataFrame'>
Index: 30 entries, 0 to 14
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   apartamento                 30 non-null     object
 1   datas_combinadas_pagamento  30 non-null     object
 2   datas_de_pagamento          30 non-null     object
 3   valor_aluguel               30 non-null     object
dtypes: object(4)
memory usage: 1.2+ KB

In [14]:
#tratando os dados da coluna numérica:
dados_locacao['valor_aluguel'] = dados_locacao['valor_aluguel'].apply(lambda x: x.replace('$', '').replace(',', '.').replace('reais', '').strip())
dados_locacao.head(1)

      apartamento datas_combinadas_pagamento datas_de_pagamento valor_aluguel
0  A101 (blocoAP)                 01/06/2022         05/06/2022        1000.0

In [15]:
#Convertendo para tipo float:
dados_locacao['valor_aluguel'] = dados_locacao['valor_aluguel'].astype(np.float64)

# Aula 3

##### Para o DataFrame 'dados_vendas':

In [16]:
dados_vendas.head(1)

  Data de venda          Cliente  Valor da compra
0    06/06/2022  @ANA _LUCIA 321            836.5

In [17]:
#Transformando em letras minúsculas:
dados_vendas['Cliente'] = dados_vendas['Cliente'].str.lower()

In [18]:
#Elimimando caracteres que não sejam correspondentes a letras:
dados_vendas['Cliente'] = dados_vendas['Cliente'].str.replace('[^a-z]', ' ', regex = True)

In [19]:
#Resetando os índices (tratamento não realiado após .explode()):
dados_vendas.reset_index(inplace = True, drop = True)

##### Para o DataFrame 'dados_locacao'

In [20]:
dados_locacao.head(1)

      apartamento datas_combinadas_pagamento datas_de_pagamento  valor_aluguel
0  A101 (blocoAP)                 01/06/2022         05/06/2022         1000.0

In [21]:
#Removendo '(blocoAP)' da coluna 'apartamento':
dados_locacao['apartamento'] = dados_locacao['apartamento'].apply(lambda x: x.replace('(blocoAP)', ''))

In [22]:
#Resetando os índices (tratamento não realiado após .explode()):
dados_locacao.reset_index(inplace = True, drop = True)

# Aula 4:

##### Para o DataFrame 'dados_vendas':

In [26]:
dados_vendas.head(1)
#Formato 'dia/mes/ano'

  Data de venda          Cliente  Valor da compra
0    06/06/2022   ana  lucia                836.5

In [27]:
#Verificando tipo dos dados:
dados_vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     object
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: float64(1), object(2)
memory usage: 612.0+ bytes

In [29]:
#Convertendo para tipo 'datetime':
dados_vendas['Data de venda'] = pd.to_datetime(dados_vendas['Data de venda'])

In [30]:
#Checando novamente os tipos:
dados_vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     datetime64[ns]
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 612.0+ bytes

In [37]:
#Extraindo informações sobre valor de compra em cada dia:
subset = dados_vendas.groupby('Data de venda')[['Valor da compra']].sum()
subset

               Valor da compra
Data de venda
2022-06-06             2314.97
2022-07-06             1647.25
2022-08-06             2321.83
2022-09-06             2162.71
2022-10-06             2409.79

##### Para o DataFrame 'dados_locacao':

In [53]:
dados_locacao.head(1)

  apartamento datas_combinadas_pagamento datas_de_pagamento  valor_aluguel
0       A101                  2022-01-06         2022-05-06         1000.0

In [54]:
#Ajustando formato:
dados_locacao['datas_combinadas_pagamento'] = pd.to_datetime(dados_locacao['datas_combinadas_pagamento'], format='mixed')
dados_locacao['datas_de_pagamento'] = pd.to_datetime(dados_locacao['datas_de_pagamento'], format='mixed')

In [57]:
#Convertendo:
dados_locacao['datas_combinadas_pagamento'] = pd.to_datetime(dados_locacao['datas_combinadas_pagamento'])
dados_locacao['datas_de_pagamento'] = pd.to_datetime(dados_locacao['datas_de_pagamento'])

In [59]:
#Checando tipo:
dados_locacao.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   apartamento                 30 non-null     object
 1   datas_combinadas_pagamento  30 non-null     datetime64[ns]
 2   datas_de_pagamento          30 non-null     datetime64[ns]
 3   valor_aluguel               30 non-null     float64
dtypes: datetime64[ns](2), float64(1), object(1)
memory usage: 1.1+ KB

In [63]:
#Calculando atraso:
dados_locacao['atraso'] = (dados_locacao['datas_de_pagamento'] - dados_locacao['datas_combinadas_pagamento'])\
.dt.days
dados_locacao.head(1)

,apartamento,datas_combinadas_pagamento,datas_de_pagamento,valor_aluguel,atraso
0,A101,2022-01-06,2022-05-06,1000.0,120

In [66]:
#Média de atraso:
media_atraso = dados_locacao.groupby('apartamento')['atraso'].mean()
media_atraso.head(1)

apartamento
A101     89.5
Name: atraso, dtype: float64